CREATE DATABASE  IF NOT EXISTS `jol` /*!40100 DEFAULT CHARACTER SET latin1 */;
USE `jol`;
-- MySQL dump 10.13  Distrib 5.5.16, for Win32 (x86)
--
-- Host: 172.24.10.6    Database: jol
-- ------------------------------------------------------
-- Server version	5.0.77

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Not dumping tablespaces as no INFORMATION_SCHEMA.FILES table on this server
--

--
-- Table structure for table `mail`
--

DROP TABLE IF EXISTS `mail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `mail` (
  `mail_id` int(11) NOT NULL auto_increment,
  `to_user` varchar(20) NOT NULL default '',
  `from_user` varchar(20) NOT NULL default '',
  `title` varchar(200) NOT NULL default '',
  `content` text,
  `new_mail` tinyint(1) NOT NULL default '1',
  `reply` tinyint(4) default '0',
  `in_date` datetime default NULL,
  `defunct` char(1) NOT NULL default 'N',
  PRIMARY KEY  (`mail_id`),
  KEY `uid` (`to_user`)
) ENGINE=MyISAM AUTO_INCREMENT=1038 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mail`
--

LOCK TABLES `mail` WRITE;
/*!40000 ALTER TABLE `mail` DISABLE KEYS */;
INSERT INTO `mail` VALUES (1000,'09110200130','778477','- -+','测试一下oj的新功能\r\n\r\n\r\n吼吼',1,0,'2011-05-26 21:18:54','N'),(1001,'778477','778477','text','who are you ',0,0,'2011-09-08 16:31:20','N'),(1002,'lsb','admin','关于oj系统','最近oj系统总会出一些评测问题，现在已经调整好，但是不知道会不会有其他问题，谢谢这么长时间的支持，希望能够多多参与oj的建设，带动大家快乐编程，谢谢！',1,0,'2011-09-20 21:27:43','N'),(1003,'10111100223','admin','关于oj系统','最近oj系统总会出一些评测问题，现在已经调整好，但是不知道会不会有其他问题，谢谢这么长时间的支持，希望能够多多参与oj的建设，带动大家快乐编程，谢谢！',1,0,'2011-09-20 21:28:53','N'),(1004,'huxin26321','admin','关于oj系统','最近oj系统总会出一些评测问题，现在已经调整好，但是不知道会不会有其他问题，谢谢这么长时间的支持，希望能够多多参与oj的建设，带动大家快乐编程，谢谢！',0,0,'2011-09-20 21:29:45','N'),(1005,'smymingyu','admin','关于oj系统','最近oj系统总会出一些评测问题，现在已经调整好，但是不知道会不会有其他问题，谢谢这么长时间的支持，希望能够多多参与oj的建设，带动大家快乐编程，谢谢！',1,0,'2011-09-20 21:30:01','N'),(1006,'mo01782964','admin','关于oj系统','最近oj系统总会出一些评测问题，现在已经调整好，但是不知道会不会有其他问题，谢谢这么长时间的支持，希望能够多多参与oj的建设，带动大家快乐编程，谢谢！',1,0,'2011-09-20 21:30:18','N'),(1007,'12111600226','11111800229','1015','请问1015的那个是怎么弄的？能发个代码看看吗？我 的怎么总是结果错误？',1,0,'2013-11-23 10:00:04','N'),(1008,'13110100909','13110100908','1','1',0,0,'2014-08-19 09:35:51','N'),(1009,'13110100908','13110100909','23333','66666666',0,0,'2014-08-19 09:37:59','N'),(1010,'13110100909','13110100908','接受正义的制裁吧！','我的假发会把你撕成碎片！！！！',0,0,'2014-08-19 10:10:47','N'),(1011,'13110100925','13110100908','接受正义的制裁吧！','233333333333333333333333333',1,0,'2014-08-19 10:13:06','N'),(1012,'13110100909','13110100908',' 而对方问我你·二纺机SEOij得搜刺激偶的藕丝金色欧IF奖艘俄IFC金色欧覅金色欧IF奖哦ij哦ijedoijeosiejf哦iedjwoeidjwoeifj 而递减SEO覅就气温udwurwr8ui9e8ud89fuc9e8fuoieufcs98euser(⊙o⊙)金融网科技融合','(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)',0,0,'2014-08-19 10:35:54','N'),(1013,'13110100925','13110100908','(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)','(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)(⊙o⊙)',1,0,'2014-08-19 10:37:09','N'),(1014,'13110600504','13110600504','13110600504','',0,0,'2014-09-11 16:41:11','N'),(1015,'13110600521','131106005211','13110600521','',1,0,'2014-09-11 16:41:38','N'),(1016,'13110600504','13110600504','熊超','',0,0,'2014-09-11 16:42:52','N'),(1017,'13110600504','13110600504','熊超','',0,0,'2014-09-11 16:45:04','N'),(1018,'13110600521','131106005211','张子雄','',1,0,'2014-09-11 16:45:48','N'),(1019,'131106005211','131106005211','131106005211','',0,0,'2014-09-11 16:47:29','N'),(1020,'131106005211','131106005211','张子雄','',1,0,'2014-09-11 16:47:59','N'),(1021,'131106005211','131106005211','张子雄','',0,0,'2014-09-11 16:48:18','N'),(1022,'131106005211','131106005211','张子雄','',0,0,'2014-09-11 16:48:59','N'),(1023,'131106005211','131106005211','13110600521','',0,0,'2014-09-11 16:49:34','N'),(1024,'131106005211','131106005211','张子雄','',0,0,'2014-09-11 16:49:53','N'),(1025,'131106005211','131106005211','张子雄','',0,0,'2014-09-11 16:51:00','N'),(1026,'131106005211','131106005211','张子雄','',0,0,'2014-09-11 16:51:55','N'),(1027,'131106005211','131106005211','13110600521','',0,0,'2014-09-11 16:52:56','N'),(1028,'131106005211','131106005211','13110600521','',0,0,'2014-09-11 16:53:30','N'),(1029,'131106005211','131106005211','张子雄','',1,0,'2014-09-11 16:54:59','N'),(1030,'131106005211','131106005211','张子雄','',1,0,'2014-09-11 16:55:47','N'),(1031,'131106005211','131106005211','张子雄','',0,0,'2014-09-11 16:56:32','N'),(1032,'13110600513','13110600513','邹景旺','',1,0,'2014-09-11 17:00:15','N'),(1033,'131106005211','131106005211','13110600521','13110600521',0,0,'2014-09-11 18:10:06','N'),(1034,'131106005211','131106005211','13110600521','',1,0,'2014-09-11 18:28:16','N'),(1035,'13110600521','131106005211','张子雄','',1,0,'2014-09-11 18:30:08','N'),(1036,'131106005211','131106005211','张子雄','',1,0,'2014-09-11 18:30:24','N'),(1037,'13110100608','13110600707','求O题答案','',1,0,'2014-09-12 13:43:02','N');
/*!40000 ALTER TABLE `mail` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-09-22 12:50:20
